OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_cfb.c
// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_encrypt_8) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 128 Encrypt message_len=8",
    .p_plaintext        = "324015878cdc82bf",
    .p_ciphertext       = "873250152fc6a5bb",
    .p_key              = "c028e6bf2b749ffa86759f2f84e93cb0",
    .p_iv               = "288c752d9faccf367e5d0cca1fa6ec3b"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 8
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_encrypt_9) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 128 Encrypt message_len=9",
    .p_plaintext        = "57c1a30e48166d9640",
    .p_ciphertext       = "e9a8c3b776edd39e3d",
    .p_key              = "d01da95d2c2a61da06ea78cfba59cc30",
    .p_iv               = "f9a393ad90814faf262e3a5b1d97592e"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 9
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_encrypt_10) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 128 Encrypt message_len=10",
    .p_plaintext        = "87efeb8d559ed3367728",
    .p_ciphertext       = "8e9c50425614d540ce11",
    .p_key              = "3a6f9159263fa6cef2a075caface5817",
    .p_iv               = "0fc23662b7dbf73827f0c7de321ca36e"
};



// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_1) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=1",
    .p_plaintext        = "09",
    .p_ciphertext       = "21",
    .p_key              = "03edfe082550bd5ac8ddf64f42a0547f",
    .p_iv               = "52acd8dab62c981da08e51939cc08dab"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_2) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=2",
    .p_plaintext        = "eb24",
    .p_ciphertext       = "4878",
    .p_key              = "38cf776750162edc63c3b5dbe311ab9f",
    .p_iv               = "98fbbd288872c40f1926b16ecaec1561"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=3",
    .p_plaintext        = "910949",
    .p_ciphertext       = "aeb6d2",
    .p_key              = "c9053c87c3e56bc5e52bd31f6545f991",
    .p_iv               = "b8f9640d0923da13fe6eb87b01f0cfa0"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=4",
    .p_plaintext        = "3b7f1f1c",
    .p_ciphertext       = "83cab2f3",
    .p_key              = "e96771f5f20a89ee871261d2d18e1e46",
    .p_iv               = "6e86403e33396655907ae06ef192262f"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=5",
    .p_plaintext        = "17b9b9e16d",
    .p_ciphertext       = "49f73e652b",
    .p_key              = "92ad13ecb60bde1bb3b34ce07867672b",
    .p_iv               = "f95a4060b8f80e3f839d4c3ca33dad94"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_6) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=6",
    .p_plaintext        = "ca989fa4e818",
    .p_ciphertext       = "b0eacbf2ca46",
    .p_key              = "eb57b8dd076e7bbb33d4bfc4d7ecb27e",
    .p_iv               = "51135997a067dcd2e016c57134c5fa52"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 6
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_7) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=7",
    .p_plaintext        = "5405da1186b7e0",
    .p_ciphertext       = "08fbef9b2a369a",
    .p_key              = "70abc48bb1be490183f0fe3df56195ff",
    .p_iv               = "e251f179174b71ee1e488ab3dd200483"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_8) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=8",
    .p_plaintext        = "d497df73afb9787c",
    .p_ciphertext       = "b3cb9d8892423aeb",
    .p_key              = "1273b8e0eee1a1ca827059b4d0a3a55d",
    .p_iv               = "622cab49092d026f554dd98a6441dc26"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 8
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_9) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=9",
    .p_plaintext        = "f203bcd402b65919da",
    .p_ciphertext       = "01992a986279c3685e",
    .p_key              = "49437e06b6faa5f20fd98bf71f8ff554",
    .p_iv               = "63c818e0d3cb5b7054ef3e1e87df0e12"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 9
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_128_decrypt_10) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 128 Decrypt message_len=10",
    .p_plaintext        = "feff4e2e2458addf2a54",
    .p_ciphertext       = "c9c284e9abbfe6fb11fe",
    .p_key              = "6399c1dc068ba3509845628fa9ed1a96",
    .p_iv               = "1157c2766c86b754df485be9dd5851df"
};


// AES CFB8 - NIST CAVS 11.1 Monte Carlo 128 Encrypt
NRF_SECTION_ITEM_REGISTER(test_vector_aes_monte_carlo_data, test_vector_aes_t test_vector_aes_cfb_128_encrypt_monte_carlo) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 Encrypt Monte Carlo 128",
    .p_plaintext        = "b7",
    .p_ciphertext       = "48",
    .p_key              = "4f139e69f5f6b81258fb612efc6464ae",
    .p_iv               = "150af93612b3630f898e52febf1e4e41"
};

