OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_cfb.c
// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_encrypt_6) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 192 Encrypt message_len=6",
    .p_plaintext        = "b57f12342a62",
    .p_ciphertext       = "73ff9bf3ec4b",
    .p_key              = "c5be271a29f4a29e085e8e98196601dcb88ccc03e559a304",
    .p_iv               = "9f51fa2eb8a084718f7240e47d135dce"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 6
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_encrypt_7) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 192 Encrypt message_len=7",
    .p_plaintext        = "6dcede43c2ee65",
    .p_ciphertext       = "7c897658282220",
    .p_key              = "9c55322e6d495be01076d4b80371ad1479ae5636ff9861f5",
    .p_iv               = "2b79cfc1ff37254dedf5924a6b61e3e0"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_encrypt_8) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 192 Encrypt message_len=8",
    .p_plaintext        = "ceda42527871f802",
    .p_ciphertext       = "d92ff89045b1917f",
    .p_key              = "6e78ccece7d1b2a3c08cf0de738bee33cbbbf78d9bf4922c",
    .p_iv               = "4bbe15b1e94a7b97250a2136d8804e46"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 8
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_encrypt_9) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 192 Encrypt message_len=9",
    .p_plaintext        = "1b0a63d73464ab3c8a",
    .p_ciphertext       = "5485847e5d3c2e2cc4",
    .p_key              = "13c98665746f7825b37b404916240adbd1e4364be1d05c63",
    .p_iv               = "0e479fbd5f3961f38b8a26be1f2d65c5"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 9
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_encrypt_10) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 192 Encrypt message_len=10",
    .p_plaintext        = "d3d8b9b984adc24237ee",
    .p_ciphertext       = "3879fea72ac99929e53a",
    .p_key              = "537e7bf661fd4024a024613f15b13690f7d0c847c1e18965",
    .p_iv               = "3a81f9d9d3c155b0caad5d73349476fc"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_1) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=1",
    .p_plaintext        = "2d",
    .p_ciphertext       = "25",
    .p_key              = "7dbdc15ad4034ed828dc862799b7adc9abd68eaf9d526d5d",
    .p_iv               = "4359683af5a3a85c248fb7f5506f317b"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_2) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=2",
    .p_plaintext        = "7b04",
    .p_ciphertext       = "0678",
    .p_key              = "3a2cdf9c9608c1dd6233d03dd855293b0885915114b25279",
    .p_iv               = "e7a28ee34acc52128ddae658ec6398a2"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=3",
    .p_plaintext        = "658d0a",
    .p_ciphertext       = "037cf6",
    .p_key              = "c984b99a6cc5bc88003143cbe4b755e6e30ba94114f7ad1e",
    .p_iv               = "41e3b8fd138f8c358dfeef420302f634"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=4",
    .p_plaintext        = "2d191f2f",
    .p_ciphertext       = "0fb0cee2",
    .p_key              = "39747da225bdc0c53c3463fd686dbe19d14157535171f91d",
    .p_iv               = "77d3a5ad8bbdb169f8d29e5f21798651"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=5",
    .p_plaintext        = "105a64c872",
    .p_ciphertext       = "09d914cf0b",
    .p_key              = "4cd13179dfa16d01c6a8633dfc8783e723e72114c9b0d50a",
    .p_iv               = "6657c46c99d642474c330d8016b71dbe"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_6) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=6",
    .p_plaintext        = "98f332d37b78",
    .p_ciphertext       = "288c752d9fac",
    .p_key              = "5dcc9b8d8a456e9917cd8d54d7f7100b34964b4ed2d398a0",
    .p_iv               = "4fa295a8987f1b010ce4e011fbf94156"
};

