OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_cfb.c
// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 6
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_7) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=7",
    .p_plaintext        = "56bb4c3cae53b3",
    .p_ciphertext       = "c9981a34b7aa89",
    .p_key              = "c8baf0204ef80b8e0125efe43a0bccdfd0f356b62e6c75fe",
    .p_iv               = "e9144bf2cbc5720a1b4cb6f37d11edff"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_8) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=8",
    .p_plaintext        = "b567411bc61b0a76",
    .p_ciphertext       = "d8fcf83a88510a0d",
    .p_key              = "64e40763f38a63ae378c32052b0ae3aa538bb868a04ac985",
    .p_iv               = "aacf65089e4b285438451ffdcd0f6389"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 8
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_9) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=9",
    .p_plaintext        = "89358df65c3ef14d26",
    .p_ciphertext       = "9c195b1944c4af5bfb",
    .p_key              = "7bfdca9605f17253f203efffc92da96fde023007d22cdad0",
    .p_iv               = "45c09e44036070f8a7737a5176b8cf26"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 9
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_10) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 192 Decrypt message_len=10",
    .p_plaintext        = "9895932402393dc33a60",
    .p_ciphertext       = "729c0b6deb75fa6eb5e8",
    .p_key              = "baf08b76317a65c5f07ae6f57eb0e65488659324d29709e3",
    .p_iv               = "0a02846b62abb693ef31d754842eed29"
};


// AES CFB8 - NIST CAVS 11.1 Monte Carlo 192 Encrypt
NRF_SECTION_ITEM_REGISTER(test_vector_aes_monte_carlo_data, test_vector_aes_t test_vector_aes_cfb_192_encrypt_monte_carlo) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 Encrypt Monte Carlo 192",
    .p_plaintext        = "92",
    .p_ciphertext       = "96",
    .p_key              = "dc66d5ccce06d47fee3fa2eb65e2dc0bd8536df29ae85c54",
    .p_iv               = "c3caee0b8e23f400cd472daefc4ba204"
};

// AES CFB8 - NIST CAVS 11.1 Monte Carlo 192 Decrypt
NRF_SECTION_ITEM_REGISTER(test_vector_aes_monte_carlo_data, test_vector_aes_t test_vector_aes_cfb_192_decrypt_monte_carlo) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 Decrypt Monte Carlo 192",
    .p_plaintext        = "4b",
    .p_ciphertext       = "33",
    .p_key              = "d86b0dc7a9016a8ff57840a0443e1108c0ebe33f52d58b5a",
    .p_iv               = "d5fc3d0cdce1e64da43049776e32593e"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CFB_192)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CFB_256)

// AES CFB8 - Functional test using test vector NIST CAVS 11.1 CFB8 KeySbox 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_func_data, test_vector_aes_t test_vector_aes_cfb_256_functional) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Functional",
    .p_plaintext        = "00",
    .p_ciphertext       = "46",
    .p_key              = "c47b0294dbbbee0fec4757f22ffeee3587ca4730c3d33b691df38bab076bc558",
    .p_iv               = "00000000000000000000000000000000"
};


// AES CFB8 - NIST CAVS 11.1 GFSBox Tests 256 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_gfsb0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt GFSBox 0",
    .p_plaintext        = "00",
    .p_ciphertext       = "5c",
    .p_key              = "0000000000000000000000000000000000000000000000000000000000000000",
    .p_iv               = "014730f80ac625fe84f026c60bfd547d"
};

// AES CFB8 - NIST CAVS 11.1 GFSBox Tests 256 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_gfsb0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt GFSBox 0",
    .p_plaintext        = "00",
    .p_ciphertext       = "5c",
    .p_key              = "0000000000000000000000000000000000000000000000000000000000000000",
    .p_iv               = "014730f80ac625fe84f026c60bfd547d"
};

// AES CFB8 - NIST CAVS 11.1 VarKey Tests 256 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_vk0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt VarKey 0",
    .p_plaintext        = "00",
    .p_ciphertext       = "e3",
    .p_key              = "8000000000000000000000000000000000000000000000000000000000000000",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CFB8 - NIST CAVS 11.1 VarKey Tests 256 Encrypt - Count 255
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_vk255) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt VarKey 255",
    .p_plaintext        = "00",
    .p_ciphertext       = "4b",
    .p_key              = "ffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff",
    .p_iv               = "00000000000000000000000000000000"
};

