OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_cfb.c
// AES CFB8 - NIST CAVS 11.1 VarKey Tests 256 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_vk0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt VarKey 0",
    .p_plaintext        = "00",
    .p_ciphertext       = "e3",
    .p_key              = "8000000000000000000000000000000000000000000000000000000000000000",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CFB8 - NIST CAVS 11.1 VarKey Tests 256 Decrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_vk127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt VarKey 127",
    .p_plaintext        = "00",
    .p_ciphertext       = "4b",
    .p_key              = "ffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CFB8 - NIST CAVS 11.1 VarTxt Tests 256 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_vt0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt VarTxt 0",
    .p_plaintext        = "00",
    .p_ciphertext       = "dd",
    .p_key              = "0000000000000000000000000000000000000000000000000000000000000000",
    .p_iv               = "80000000000000000000000000000000"
};

// AES CFB8 - NIST CAVS 11.1 VarTxt Tests 256 Encrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_vt127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt VarTxt 127",
    .p_plaintext        = "00",
    .p_ciphertext       = "ac",
    .p_key              = "0000000000000000000000000000000000000000000000000000000000000000",
    .p_iv               = "ffffffffffffffffffffffffffffffff"
};

// AES CFB8 - NIST CAVS 11.1 VarTxt Tests 256 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_vt0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt VarTxt 0",
    .p_plaintext        = "00",
    .p_ciphertext       = "dd",
    .p_key              = "0000000000000000000000000000000000000000000000000000000000000000",
    .p_iv               = "80000000000000000000000000000000"
};

// AES CFB8 - NIST CAVS 11.1 VarTxt Tests 256 Decrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_vt127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt VarTxt 127",
    .p_plaintext        = "00",
    .p_ciphertext       = "ac",
    .p_key              = "0000000000000000000000000000000000000000000000000000000000000000",
    .p_iv               = "ffffffffffffffffffffffffffffffff"
};


// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_1) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=1",
    .p_plaintext        = "f9",
    .p_ciphertext       = "28",
    .p_key              = "34e8091cee09f1bd3ebf1e8f05f51bfbd4899ef2ae006a3a0f7875052cdd46c8",
    .p_iv               = "43eb4dcc4b04a80216a20e4a09a7abb5"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_2) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=2",
    .p_plaintext        = "2914",
    .p_ciphertext       = "69a6",
    .p_key              = "e04e43173113109e1343393842fe6caef3f8a2e506d7f55f83dcb10444c6ad23",
    .p_iv               = "a38b88a293b077fb5546636aad90d663"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=3",
    .p_plaintext        = "b974fa",
    .p_ciphertext       = "1cff95",
    .p_key              = "064874092f7a13cc4462247ad423d0e96edf42e8b67a5a23b7a0a6477b098e66",
    .p_iv               = "338c552ff1eca14408e05d8cf9f3b31b"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=4",
    .p_plaintext        = "db774912",
    .p_ciphertext       = "f04d9d4f",
    .p_key              = "56794adb0ef04aeddeabd650de736531d408837954b919002c33edfdff976cc2",
    .p_iv               = "71b5526facea4236d33f1f4107e4b04f"
};

