OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_cfb.c
// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=5",
    .p_plaintext        = "ad1d5311ea",
    .p_ciphertext       = "19cc97a662",
    .p_key              = "dddd7f234e7d0e6ec64560b96430986a856f2ee9805443a7946e31601ef6679d",
    .p_iv               = "e20f39db0025eb24491bd06012887108"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_6) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=6",
    .p_plaintext        = "02fe724fbc5d",
    .p_ciphertext       = "b0eca63405f4",
    .p_key              = "ec73a760272c83f91771b3ab7b188715c6d6afb9c554feae83856e966a3863d0",
    .p_iv               = "ae7bfa38fd25778fcf66ce8157f6e42e"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 6
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_7) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=7",
    .p_plaintext        = "b4777e6bcd9a05",
    .p_ciphertext       = "8c017397ad5bab",
    .p_key              = "a66874ca0b70fb98b37c033ec96413f339adae02acade015b9f016b459db3309",
    .p_iv               = "6ed480d9e4ed031cf66bb1e07f8d5514"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_8) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=8",
    .p_plaintext        = "1d70a5a82badf5ea",
    .p_ciphertext       = "1e22bebebeacd81d",
    .p_key              = "a3dbbb775ada92b0b8ed1632444e21c1c86ff3eba8f628307306e766b8c15b5c",
    .p_iv               = "4ec56a8e541f5cfe7b8ab947bfa4fd08"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 8
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_9) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=9",
    .p_plaintext        = "a36ca5ea382a322eef",
    .p_ciphertext       = "3105016567d3174aed",
    .p_key              = "64135e67c0ca1acef3360d930afcd726c5b04861a69c1b6a48bde1daf20f3b1f",
    .p_iv               = "5377a154d5f948189f9aa57b466c16b2"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Encrypt - Count 9
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_10) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 256 Encrypt message_len=10",
    .p_plaintext        = "b0fe25ac8d3d28a2f471",
    .p_ciphertext       = "638c6823e7256fb5626e",
    .p_key              = "ebbb4566b5e182e0f072466b0b311df38f9175bc0213a5530bce2ec4d74f400d",
    .p_iv               = "0956a48e01002c9e16376d6e308dbad1"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_1) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=1",
    .p_plaintext        = "98",
    .p_ciphertext       = "6f",
    .p_key              = "1687831580cb764321a9d674dbd0a9640f668b0f58ef01b87a710b3095d5f855",
    .p_iv               = "6cd5bec6d6e1fd23afc543b8f80d3f89"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_2) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=2",
    .p_plaintext        = "3572",
    .p_ciphertext       = "17d4",
    .p_key              = "b6b504e8b7065373ea31cd549e52eda7cb96fd1db14eddacbc420085ab48b747",
    .p_iv               = "870ecd45b1241803ddaf8bad15a025d7"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=3",
    .p_plaintext        = "f9411a",
    .p_ciphertext       = "a9841e",
    .p_key              = "6ad3105e15fb5b742bf4fe1eb8e98c6c1ffea653107c84f6b42ed1232a0bbc21",
    .p_iv               = "17534c89c4eae5dea6ea353dde7b1623"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=4",
    .p_plaintext        = "47887872",
    .p_ciphertext       = "84b35e25",
    .p_key              = "758f3fa8b2b289f19fd59e7316be40b904eff7f565caac4570f972360e0da787",
    .p_iv               = "b21335ae980898fa92c4b3069e532973"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=5",
    .p_plaintext        = "ed414b5689",
    .p_ciphertext       = "d1e96bf1e8",
    .p_key              = "802e854eb799500975d960a67885820d195e02ab23d51f15e5cdbcee86a1580c",
    .p_iv               = "94478c4e44e2fa8d2e6bc43d384597e6"
};

