OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_cfb.c
// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_6) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=6",
    .p_plaintext        = "8207eee2a7ab",
    .p_ciphertext       = "74410ccd12da",
    .p_key              = "3a0c03ca9d1e5d49bb37f9041f88d159c3f1d5ce26c798f59ed54a93f0a0e600",
    .p_iv               = "9aae38ba832e4b093b50444074517d20"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 6
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_7) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=7",
    .p_plaintext        = "aff3aa4c24e353",
    .p_ciphertext       = "ff039e89877b44",
    .p_key              = "ee05462128fea75e919f6f436cb198f222847d698a283f5767df682d33d3ce77",
    .p_iv               = "d2ad55e41887075184635112a22fc093"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_8) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=8",
    .p_plaintext        = "b7370050288bf600",
    .p_ciphertext       = "e176ba99ea602fd9",
    .p_key              = "08abbdcc3eb9c1717db1faa38dcd0893afd5e16e2596747af58f8d61ebedf9cd",
    .p_iv               = "b925c8dc9a9b55a4372ea6d37d21c1eb"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 8
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_9) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=9",
    .p_plaintext        = "e44995bbb0fff40fee",
    .p_ciphertext       = "c55a9a917a809a784b",
    .p_key              = "56d404a893fb3b3f594aab18939230b096646a37a781629fbd9270f3891a5cea",
    .p_iv               = "e5906b36f2d97e6f2db19b6c7a3ce319"
};

// AES CFB8 - NIST CAVS 11.1 Multiblock Message Tests 256 Decrypt - Count 9
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_10) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 256 Decrypt message_len=10",
    .p_plaintext        = "547bfd642cf6e12ed942",
    .p_ciphertext       = "2bfc3f0209307140101a",
    .p_key              = "ec13062551e4d7291e320f565b749eea1809b663b26f2c4d53b52058b833e0ad",
    .p_iv               = "fbfa5a528e20863012790c2abafb5a0c"
};

// AES CFB8 - NIST CAVS 11.1 Monte Carlo 256 Encrypt
NRF_SECTION_ITEM_REGISTER(test_vector_aes_monte_carlo_data, test_vector_aes_t test_vector_aes_cfb_256_encrypt_monte_carlo) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CFB8 Encrypt Monte Carlo 256",
    .p_plaintext        = "b9",
    .p_ciphertext       = "46",
    .p_key              = "7c046546c5542ff9c06823cc78efc28e8fd1e8ffd56ffc36192c6a40402c530a",
    .p_iv               = "ea42a2fb73b36b8951c187a10205fcc4"
};

// AES CFB8 - NIST CAVS 11.1 Monte Carlo 256 Decrypt
NRF_SECTION_ITEM_REGISTER(test_vector_aes_monte_carlo_data, test_vector_aes_t test_vector_aes_cfb_256_decrypt_monte_carlo) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cfb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CFB8 Decrypt Monte Carlo 256",
    .p_plaintext        = "a4",
    .p_ciphertext       = "aa",
    .p_key              = "39b7297f2d0504dc87e1f4c5e2ca8a567c580b8de723c55102e0a3b328cd0073",
    .p_iv               = "ffe3c1b78e92e01779f29a9349f76bc8"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CFB_256)

/*lint -restore */

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CFB)
